## Production: pinpoint_to_sqs_sms_callbacks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                         NAME                                         |
|--------|--------------------------------------------------------------------------------------|
| delete | `aws_cloudwatch_metric_alarm.pinpoint-sms-success-rate-canadian-numbers-critical[0]` |
| add    | `aws_cloudwatch_dashboard.pinpoint[0]`                                               |
|        | `aws_cloudwatch_metric_alarm.pinpoint-sms-success-rate-critical[0]`                  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_cloudwatch_dashboard.pinpoint[0] will be created
  + resource "aws_cloudwatch_dashboard" "pinpoint" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = (known after apply)
      + dashboard_name = "Pinpoint"
      + id             = (known after apply)
    }

  # aws_cloudwatch_metric_alarm.pinpoint-sms-success-rate-canadian-numbers-critical[0] will be destroyed
  # (because aws_cloudwatch_metric_alarm.pinpoint-sms-success-rate-canadian-numbers-critical is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "pinpoint-sms-success-rate-canadian-numbers-critical" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ] -> null
      - alarm_description         = "Pinpoint SMS success rate to Canadian numbers is below 25% over 2 consecutive periods of 12 hours" -> null
      - alarm_name                = "pinpoint-sms-success-rate-canadian-numbers-critical" -> null
      - arn                       = "arn:aws:cloudwatch:ca-central-1:296255494825:alarm:pinpoint-sms-success-rate-canadian-numbers-critical" -> null
      - comparison_operator       = "LessThanThreshold" -> null
      - datapoints_to_alarm       = 2 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 2 -> null
      - id                        = "pinpoint-sms-success-rate-canadian-numbers-critical" -> null
      - insufficient_data_actions = [] -> null
      - ok_actions                = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-ok",
        ] -> null
      - period                    = 0 -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 0.25 -> null
      - treat_missing_data        = "notBreaching" -> null

      - metric_query {
          - id          = "failures" -> null
          - period      = 0 -> null
          - return_data = false -> null

          - metric {
              - dimensions  = {} -> null
              - metric_name = "pinpoint-sms-failures" -> null
              - namespace   = "LogMetrics" -> null
              - period      = 43200 -> null
              - stat        = "Sum" -> null
              - unit        = "Count" -> null
            }
        }
      - metric_query {
          - id          = "successes" -> null
          - period      = 0 -> null
          - return_data = false -> null

          - metric {
              - dimensions  = {} -> null
              - metric_name = "pinpoint-sms-successes" -> null
              - namespace   = "LogMetrics" -> null
              - period      = 43200 -> null
              - stat        = "Sum" -> null
              - unit        = "Count" -> null
            }
        }
      - metric_query {
          - expression  = "successes / (successes + failures)" -> null
          - id          = "success_rate" -> null
          - label       = "Success Rate" -> null
          - period      = 0 -> null
          - return_data = true -> null
        }
    }

  # aws_cloudwatch_metric_alarm.pinpoint-sms-success-rate-critical[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "pinpoint-sms-success-rate-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ]
      + alarm_description                     = "Pinpoint SMS success rate to Canadian numbers is below 25% over 2 consecutive periods of 12 hours"
      + alarm_name                            = "pinpoint-sms-success-rate-canadian-numbers-critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + datapoints_to_alarm                   = 2
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-ok",
        ]
      + tags_all                              = (known after apply)
      + threshold                             = 0.25
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "failures"
          + return_data = false

          + metric {
              + metric_name = "pinpoint-sms-failures"
              + namespace   = "LogMetrics"
              + period      = 43200
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + id          = "successes"
          + return_data = false

          + metric {
              + metric_name = "pinpoint-sms-successes"
              + namespace   = "LogMetrics"
              + period      = 43200
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + expression  = "successes / (successes + failures)"
          + id          = "success_rate"
          + label       = "Success Rate"
          + return_data = true
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.pinpoint_deliveries"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.pinpoint_deliveries_failures"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.pinpoint_to_sqs_sms_callbacks_log_group[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-image-pinpoint-delivery-receipts-errors-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-image-pinpoint-delivery-receipts-errors-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-500-error-1-minute-warning-pinpoint_to_sqs_sms_callbacks-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-500-error-5-minutes-critical-pinpoint_to_sqs_sms_callbacks-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.pinpoint-sms-blocked-as-spam-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.pinpoint-sms-phone-carrier-unavailable-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.pinpoint-sms-rate-exceeded-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.pinpoint-sms-success-rate-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.pinpoint-sms-success-rate-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.total-sms-spending-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.total-sms-spending-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.pinpoint_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.pinpoint_logs"]

35 tests, 19 passed, 16 warnings, 0 failures, 0 exceptions

```

</details>
